src/Reports/ВыгрузкаДанныхПоНевыполненнымПЗ/ВыгрузкаДанныхПоНевыполненнымПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыгрузкаДанныхПоНевыполненнымПЗ</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыЛинеек/ВидыЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛинеек</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Канбан</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыРемонта/СтатусыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонта</name>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Окончен</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ВыгрузкаДанныхПоНевыполненнымПЗ/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьПоследнююДатуПостановки(РабочееМесто,МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводственныхЗаданий.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование = &ДокументОснование
	|	И ЭтапыПроизводственныхЗаданий.РабочееМесто = &РабочееМесто
	|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала УБЫВ";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ДатаНачала);
	КонецЦикла;
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить(); 
	Для каждого ТЧ Из ТаблицаРМ Цикл
	ТЧ.КоличествоВсего = 0;		
	КонецЦикла;
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Выгрузка");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаРабочееМестоБуфер = Макет.ПолучитьОбласть("Шапка|РабочееМестоБуфер");
 
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого ТЧ Из ТаблицаРМ Цикл
		Если Найти(ТЧ.РМ.Наименование,"Буфер") > 0 Тогда
		ОблШапкаРабочееМестоБуфер.Параметры.РабочееМесто = ТЧ.РМ;
		ТабДок.Присоединить(ОблШапкаРабочееМестоБуфер);    		
		Иначе	
		ОблШапкаРабочееМесто.Параметры.РабочееМесто = ТЧ.РМ;
		ТабДок.Присоединить(ОблШапкаРабочееМесто);
		КонецЕсли; 
	КонецЦикла;

ОблМТКОбщие = Макет.ПолучитьОбласть("МТК|Общие");
ОблМТКРабочееМесто = Макет.ПолучитьОбласть("МТК|РабочееМесто");
ОблМТКРабочееМестоБуфер = Макет.ПолучитьОбласть("МТК|РабочееМестоБуфер");

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка = &Линейка
	|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)";
ЗапросЛО.УстановитьПараметр("Линейка",Отчет.Линейка);
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

ЗапросВыпуск = Новый Запрос;

ЗапросВыпуск.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
	|ГДЕ
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка = &Линейка"; 
ЗапросВыпуск.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
ЗапросВыпуск.УстановитьПараметр("ДатаКон", ТекущаяДата());
ЗапросВыпуск.УстановитьПараметр("Линейка",Отчет.Линейка);
РезультатЗапроса = ЗапросВыпуск.Выполнить();
ВыборкаВыпуск = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;
ЗапросРемонт = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ КАК ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование КАК МТК,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Ремонт
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка = &Линейка
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = &ДатаОкончания
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.НомерОчереди,
	|	ПЗ
	|ИТОГИ ПО
	|	МТК";	
Запрос.УстановитьПараметр("Линейка",Отчет.Линейка);
Запрос.УстановитьПараметр("ДатаОкончания",Дата(1,1,1));
Результат = Запрос.Выполнить();
ВыборкаМТК = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМТК.Следующий() Цикл
		Для каждого ТЧ Из ТаблицаРМ Цикл
		ТЧ.Количество = 0;		
		КонецЦикла;
	КолНеВып = 0; 	
	КолЛО = 0;
	КолОстановка = 0;
	КолРемонт = 0;
	КолНезапущенных = 0;
	ВыборкаВыпуск.Сбросить();
		Если ВыборкаВыпуск.НайтиСледующий(Новый Структура("МаршрутнаяКарта",ВыборкаМТК.МТК)) Тогда
		КолВыпСегодня = ВыборкаВыпуск.КоличествоРасход;
		КолВып = ВыборкаМТК.МТК.Количество - ВыборкаВыпуск.КоличествоКонечныйОстаток;	
		Иначе
		КолВыпСегодня = 0;
		КолВып = ВыборкаМТК.МТК.Количество;
		КонецЕсли;
	СписокЛО = ПолучитьЛО(ВыборкаМТК.МТК); 
	ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Отчет.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Канбан Тогда
			Кол = ВыборкаДетальныеЗаписи.ПЗ.ДокументОснование.Количество;
			Иначе
			Кол = 1;
			КонецЕсли;
		КолНеВып = КолНеВып + Кол; 
		ЛО = "";
		СтатусРемонта = Перечисления.СтатусыРемонта.ПустаяСсылка();
		ВыбРМ = ВыборкаДетальныеЗаписи.РабочееМесто;
		ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
			Если ЗначениеЗаполнено(ПЗ.ДатаЗапуска) Тогда
				Если ВыборкаДетальныеЗаписи.Ремонт Тогда	
				ЗапросРемонт.Текст = 
					"ВЫБРАТЬ
					|	РемонтнаяКарта.Ссылка
					|ИЗ
					|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
					|ГДЕ
					|	РемонтнаяКарта.ДокументОснование = &ДокументОснование
					|	И РемонтнаяКарта.Проведен = ЛОЖЬ";			
				ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
				РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
				ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
					Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
					СтатусРемонта = Перечисления.СтатусыРемонта.Ремонт;
					КолРемонт = КолРемонт + Кол;
					КонецЦикла;
				КонецЕсли;
			Выборка = ТаблицаРМ.НайтиСтроки(Новый Структура("РМ",ВыбРМ));
			Выборка[0].Количество = Выборка[0].Количество + Кол;
			Иначе
				Если СписокЛО.Количество() > 0 Тогда
				КолЛО = КолЛО + Кол;				
				КонецЕсли; 
			КолНезапущенных = КолНезапущенных + Кол;
			КонецЕсли;			
		КонецЦикла;
			Если ВыборкаМТК.МТК.Статус = 2 Тогда
			КолОстановка = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),ВыборкаМТК.МТК);
			ПричинаОстановки = СокрЛП(ВыборкаМТК.МТК.Остановки[ВыборкаМТК.МТК.Остановки.Количество()-1].ПричинаОстановки);
			Иначе
			КолОстановка = "";
			ПричинаОстановки = "";
			КонецЕсли;
				Если СписокЛО.Количество() > 0 Тогда
					Для каждого ЛО Из СписокЛО Цикл
					ОблМТКОбщие.Параметры.МТК = ВыборкаМТК.МТК;
					ОблМТКОбщие.Параметры.НомерМТК = ВыборкаМТК.МТК.Номер;
					ОблМТКОбщие.Параметры.ДатаМТК = Формат(ВыборкаМТК.МТК.Дата,"ДФ=dd.MM.yyyy");
					ОблМТКОбщие.Параметры.Счёт = ВыборкаМТК.МТК.Счёт;
					ОблМТКОбщие.Параметры.ДатаОтгрузки = Формат(ВыборкаМТК.МТК.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
					ОблМТКОбщие.Параметры.НО = ВыборкаМТК.МТК.НомерОчереди;
					ОблМТКОбщие.Параметры.Наименование = СокрЛП(ВыборкаМТК.МТК.Номенклатура.Наименование);
					ОблМТКОбщие.Параметры.Спецификация = ВыборкаМТК.МТК.Номенклатура;
					ОблМТКОбщие.Параметры.Статус = ПолучитьСтатус(ВыборкаМТК.МТК.Номенклатура);
					ОблМТКОбщие.Параметры.КолМТК = ВыборкаМТК.МТК.Количество;
					ОблМТКОбщие.Параметры.КолНеВып = КолНеВып;
					ОблМТКОбщие.Параметры.КолНеЗап = КолНезапущенных; 
					ОблМТКОбщие.Параметры.КолВыпСегодня = КолВыпСегодня;
					ОблМТКОбщие.Параметры.КолВып = КолВып;
					ОблМТКОбщие.Параметры.КолОстановка = КолОстановка;
					ОблМТКОбщие.Параметры.ПричинаОстановки = ПричинаОстановки;
					ОблМТКОбщие.Параметры.КолЛО = КолЛО;
					ОблМТКОбщие.Параметры.ПричинаЛО = ЛО.Значение;
						Если ТипЗнч(ЛО.Значение) = Тип("СправочникСсылка.Материалы") Тогда
						ОблМТКОбщие.Параметры.Поставщик = Константы.МестоХраненияОсновное.Получить().Подразделение;
						Иначе
						ОблМТКОбщие.Параметры.Поставщик = ЛО.Значение.Канбан.Подразделение;
						КонецЕсли; 
					ОблМТКОбщие.Параметры.КолРемонт = КолРемонт;
					ОблМТКОбщие.Параметры.СтандартныйКомментарий = ВыборкаМТК.МТК.СтандартныйКомментарий;  
					ТабДок.Вывести(ОблМТКОбщие);
						Для каждого ТЧ Из ТаблицаРМ Цикл
							Если Найти(ТЧ.РМ.Наименование,"Буфер") > 0 Тогда
							ОблМТКРабочееМестоБуфер.Параметры.КолРМ = ТЧ.Количество;
								Если ТЧ.Количество > 0 Тогда
								ОблМТКРабочееМестоБуфер.Параметры.ДатаПостановки = ПолучитьПоследнююДатуПостановки(ТЧ.РМ,ВыборкаМТК.МТК);
								Иначе	
								ОблМТКРабочееМестоБуфер.Параметры.ДатаПостановки = "";
								КонецЕсли;						 
							ТабДок.Присоединить(ОблМТКРабочееМестоБуфер);   		
							Иначе	
							ОблМТКРабочееМесто.Параметры.КолРМ = ТЧ.Количество; 
							ТабДок.Присоединить(ОблМТКРабочееМесто);
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;				
				Иначе	
				ОблМТКОбщие.Параметры.МТК = ВыборкаМТК.МТК;
				ОблМТКОбщие.Параметры.НомерМТК = ВыборкаМТК.МТК.Номер;
				ОблМТКОбщие.Параметры.ДатаМТК = Формат(ВыборкаМТК.МТК.Дата,"ДФ=dd.MM.yyyy");
				ОблМТКОбщие.Параметры.Счёт = ВыборкаМТК.МТК.Счёт;
				ОблМТКОбщие.Параметры.ДатаОтгрузки = Формат(ВыборкаМТК.МТК.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
				ОблМТКОбщие.Параметры.НО = ВыборкаМТК.МТК.НомерОчереди;
				ОблМТКОбщие.Параметры.Наименование = СокрЛП(ВыборкаМТК.МТК.Номенклатура.Наименование);
				ОблМТКОбщие.Параметры.Спецификация = ВыборкаМТК.МТК.Номенклатура;
				ОблМТКОбщие.Параметры.Статус = ПолучитьСтатус(ВыборкаМТК.МТК.Номенклатура);
				ОблМТКОбщие.Параметры.КолМТК = ВыборкаМТК.МТК.Количество;
				ОблМТКОбщие.Параметры.КолНеВып = КолНеВып;
				ОблМТКОбщие.Параметры.КолНеЗап = КолНезапущенных; 
				ОблМТКОбщие.Параметры.КолВыпСегодня = КолВыпСегодня;
				ОблМТКОбщие.Параметры.КолВып = КолВып;
				ОблМТКОбщие.Параметры.КолОстановка = КолОстановка;
				ОблМТКОбщие.Параметры.ПричинаОстановки = ПричинаОстановки;
				ОблМТКОбщие.Параметры.КолЛО = КолЛО;
				ОблМТКОбщие.Параметры.ПричинаЛО = "";
				ОблМТКОбщие.Параметры.Поставщик = "";
				ОблМТКОбщие.Параметры.КолРемонт = КолРемонт;
				ОблМТКОбщие.Параметры.СтандартныйКомментарий = ВыборкаМТК.МТК.СтандартныйКомментарий;  
				ТабДок.Вывести(ОблМТКОбщие);
					Для каждого ТЧ Из ТаблицаРМ Цикл
						Если Найти(ТЧ.РМ.Наименование,"Буфер") > 0 Тогда
						ОблМТКРабочееМестоБуфер.Параметры.КолРМ = ТЧ.Количество;
							Если ТЧ.Количество > 0 Тогда
							ОблМТКРабочееМестоБуфер.Параметры.ДатаПостановки = ПолучитьПоследнююДатуПостановки(ТЧ.РМ,ВыборкаМТК.МТК);
							Иначе	
							ОблМТКРабочееМестоБуфер.Параметры.ДатаПостановки = "";
							КонецЕсли;						 
						ТабДок.Присоединить(ОблМТКРабочееМестоБуфер);   		
						Иначе	
						ОблМТКРабочееМесто.Параметры.КолРМ = ТЧ.Количество; 
						ТабДок.Присоединить(ОблМТКРабочееМесто);
						КонецЕсли;
					КонецЦикла;				
				КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокРМ()
	Если Отчет.Линейка.Пустая() Тогда
	Возврат;
	КонецЕсли;
ТаблицаРМ.Очистить(); 
Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Отчет.Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаРМ.Добавить();
	ТЧ.РМ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ПолучитьСписокРМ();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПолучитьСписокРМ();
КонецПроцедуры

&НаСервере
Функция ПолучитьЛО(МТК)	
СписокЛО = Новый СписокЗначений;
ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)
	|	 И ЛьготнаяОчередь.ПЗ.ДокументОснование = &МТК";
ЗапросЛО.УстановитьПараметр("МТК",МТК);
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();
	Пока ВыборкаЛО.Следующий() Цикл
	СписокЛО.Добавить(ВыборкаЛО.МПЗ);
	КонецЦикла;
Возврат(СписокЛО);
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
Режим = РежимДиалогаВыбораФайла.Сохранение; 
ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
ДиалогОткрытияФайла.Фильтр               = "Выгрузка(*.xls)|*.xls"; 
ДиалогОткрытияФайла.МножественныйВыбор   = Ложь; 
ДиалогОткрытияФайла.Заголовок            = "Сохранить в файл для выгрузки"; 
	Если Не ДиалогОткрытияФайла.Выбрать() Тогда 
	Сообщить("Файл не выбран!");
    Возврат;
    КонецЕсли;
ТабДок.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
КонецПроцедуры
